# Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Importing customer data set

customer_path = r'C:\Users\iNDIA\Desktop\Career Foundry\4 Python Fundamentals for Data Analysts\Instacart Basket Analysis Mar 22\02 Data\Original Data\customers.csv'

In [3]:
df_customer = pd.read_csv(customer_path)

In [4]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [5]:
# Changing dtype
df_customer['Age'] = df_customer['Age'].astype('int32')
df_customer['n_dependants'] = df_customer['n_dependants'].astype('int32')
df_customer['income'] = df_customer['income'].astype('int32')

In [6]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int32
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int32
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int32
dtypes: int32(3), int64(1), object(6)
memory usage: 13.4+ MB

In [7]:
# Importing order data from prepared folder

ords_prods_merge_path = r'C:\Users\iNDIA\Desktop\Career Foundry\4 Python Fundamentals for Data Analysts\Instacart Basket Analysis Mar 22\02 Data\Prepared Data\orders_products_merged.pkl'

In [8]:
ords_prods_merge = pd.read_pickle(ords_prods_merge_path)

In [9]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406036 entries, 0 to 32406040
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int64
 1   user_id                 int64
 2   order_number            int64
 3   order_day_of_week       int64
 4   order_time              int64
 5   days_since_prior_order  float64
 6   first_time_customer     bool
 7   product_id              int64
 8   add_to_cart_order       int64
 9   reordered               int64
 10  product_name            object
 11  aisle_id                int64
 12  department_id           int64
 13  prices                  float64
 14  max_order               int64
 15  loyalty_flag            object
 16  mean_price              float64
 17  spending_flag           object
 18  frequency               float64
 19  Customer Type           object
dtypes: bool(1), float64(4), int64(11), object(4)
memory usage: 4.9+ GB

In [10]:
# Changing Data type of ords_prods_merge

ords_prods_merge['order_id'] = ords_prods_merge['order_id'].astype('int32')
ords_prods_merge['order_number'] = ords_prods_merge['order_number'].astype('int8')
ords_prods_merge['order_day_of_week'] = ords_prods_merge['order_day_of_week'].astype('int8')
ords_prods_merge['order_time'] = ords_prods_merge['order_time'].astype('int8')
ords_prods_merge['days_since_prior_order'] = ords_prods_merge['days_since_prior_order'].astype('float16')
ords_prods_merge['product_id'] = ords_prods_merge['product_id'].astype('int32')
ords_prods_merge['add_to_cart_order'] = ords_prods_merge['add_to_cart_order'].astype('int32')
ords_prods_merge['reordered'] = ords_prods_merge['reordered'].astype('int32')
ords_prods_merge['aisle_id'] = ords_prods_merge['aisle_id'].astype('int32')
ords_prods_merge['department_id'] = ords_prods_merge['department_id'].astype('int32')
ords_prods_merge['prices'] = ords_prods_merge['prices'].astype('float64')
ords_prods_merge['max_order'] = ords_prods_merge['max_order'].astype('int32')
ords_prods_merge['mean_price'] = ords_prods_merge['mean_price'].astype('float16')
ords_prods_merge['frequency'] = ords_prods_merge['frequency'].astype('float16')

In [11]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406036 entries, 0 to 32406040
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 int64
 2   order_number            int8
 3   order_day_of_week       int8
 4   order_time              int8
 5   days_since_prior_order  float16
 6   first_time_customer     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float64
 14  max_order               int32
 15  loyalty_flag            object
 16  mean_price              float16
 17  spending_flag           object
 18  frequency               float16
 19  Customer Type           object
dtypes: bool(1), float16(3), float64(1), int32(7), int64(1), int8(3), object(4)
memory usage: 2.8+ GB


## Wrangling Data

In [12]:
# Dropping a column not required

In [13]:
df_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [14]:
df_customer.shape

(206209, 10)

In [15]:
# Renaming column - First Name, Surnam, Gender, State, age

df_customer.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age'}, inplace = True)

In [16]:
df_customer.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [17]:
df_customer.describe()

             user_id            age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [18]:
# Checking data type
df_customer.dtypes

user_id          int64
first_name      object
last_name       object
gender          object
state           object
age              int32
date_joined     object
n_dependants     int32
fam_status      object
income           int32
dtype: object

In [19]:
# Changing data type of 'user_id'

df_customer['user_id'] = df_customer['user_id'].astype('str')

In [20]:
df_customer['user_id'].dtype

dtype('O')

In [21]:
# Transposing of Data not required

#### Wrangling Data Summary - Dropping a column is not required; Renamed few columns; Changed Data Type for 'user_id' to string; Transposing a column not required

## Data consistency check

In [22]:
df_customer.describe()

                 age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [23]:
# Data accuracy appears to be fine

In [24]:
# Checking for mixed type data

for col in df_customer.columns.tolist():
    weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_customer[weird]) > 0:
        print(col)

first_name

In [25]:
# Converting mix column 'first_name' to 'string'

df_customer['first_name'] = df_customer['first_name'].astype('str')

In [26]:
df_customer['first_name'].dtype

dtype('O')

In [27]:
# Finding missing value

df_customer.isnull().sum()

user_id         0
first_name      0
last_name       0
gender          0
state           0
age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [28]:
# Finding Duplicates

df_customer[df_customer.duplicated()]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

In [29]:
# No duplicates found

#### Data Consistency Summary - 'Mix' coulum - First_name, converted to string; no missing values found; no duplicates found

In [30]:
# Exporting Customers data to pickle in Prepared folder

customer_path = r'C:\Users\iNDIA\Desktop\Career Foundry\4 Python Fundamentals for Data Analysts\Instacart Basket Analysis Mar 22\02 Data\Prepared Data'

In [31]:
df_customer.to_pickle(os.path.join(customer_path, 'customer_data_checked.pkl'))

## Combining & Exporting Data

In [32]:
# Importing new customer checked data sheet from prepared folder
df_cust_path = r'C:\Users\iNDIA\Desktop\Career Foundry\4 Python Fundamentals for Data Analysts\Instacart Basket Analysis Mar 22\02 Data\Prepared Data\customer_data_checked.pkl'

In [33]:
df_cust = pd.read_pickle(df_cust_path)

In [34]:
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  object
 1   first_name    206209 non-null  object
 2   last_name     206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int32
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int32
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int32
dtypes: int32(3), object(7)
memory usage: 13.4+ MB

In [35]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [36]:
df_cust.shape

(206209, 10)

In [37]:
df_cust['user_id'].dtype

dtype('O')

In [38]:
ords_prods_merge.shape

(32406036, 20)

In [39]:
ords_prods_merge['user_id'].dtype

dtype('int64')

In [40]:
ords_prods_merge['user_id'] = ords_prods_merge['user_id'].astype('str')

In [41]:
ords_prods_merge['user_id'].dtype

dtype('O')

In [42]:
ords_prods_merge.shape

(32406036, 20)

In [43]:
ords_prods_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_time,days_since_prior_order,first_time_customer,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,max_order,loyalty_flag,mean_price,spending_flag,frequency,Customer Type
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,10,New customer,6.367188,Low spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,False,196,1,1,Soda,77,7,9.0,10,New customer,6.367188,Low spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,False,196,1,1,Soda,77,7,9.0,10,New customer,6.367188,Low spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,False,196,1,1,Soda,77,7,9.0,10,New customer,6.367188,Low spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,False,196,1,1,Soda,77,7,9.0,10,New customer,6.367188,Low spender,20.5,Non-frequent customer

In [44]:
%%time
ords_prods_customers_merge = ords_prods_merge.merge(df_cust, on = ['user_id'], indicator = True)

Wall time: 15min 26s

In [45]:
ords_prods_customers_merge.head()

,order_id,user_id,order_number,order_day_of_week,order_time,days_since_prior_order,first_time_customer,product_id,add_to_cart_order,reordered,...,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
1,2398795,1,2,3,7,15.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
2,473747,1,3,3,12,21.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
3,2254736,1,4,4,7,29.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both
4,431534,1,5,4,15,28.0,False,196,1,1,...,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423,both

In [46]:
ords_prods_customers_merge.shape

(32406036, 30)

In [47]:
ords_prods_customers_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406036 entries, 0 to 32406035
Data columns (total 30 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   order_number            int8
 3   order_day_of_week       int8
 4   order_time              int8
 5   days_since_prior_order  float16
 6   first_time_customer     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float64
 14  max_order               int32
 15  loyalty_flag            object
 16  mean_price              float16
 17  spending_flag           object
 18  frequency               float16
 19  Customer Type           object
 20  first_name              object
 21  last_name               object
 22  gender                  object
 23  state                   object
 24  age                     int32
 25  date_joined             object
 26  n_dependants            int32
 27  fam_status              object
 28  income                  int32
 29  _merge                  category
dtypes: bool(1), category(1), float16(3), float64(1), int32(10), int8(3), object(11)
memory usage: 4.7+ GB

In [48]:
ords_prods_merge['prices'] = ords_prods_merge['prices'].astype('float64')

In [49]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406036 entries, 0 to 32406040
Data columns (total 20 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   order_number            int8
 3   order_day_of_week       int8
 4   order_time              int8
 5   days_since_prior_order  float16
 6   first_time_customer     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float64
 14  max_order               int32
 15  loyalty_flag            object
 16  mean_price              float16
 17  spending_flag           object
 18  frequency               float16
 19  Customer Type           object
dtypes: bool(1), float16(3), float64(1), int32(7), int8(3), object(5)
memory usage: 2.8+ GB

In [50]:
#Making changes to 'Prices'
ords_prods_customers_merge['prices'].describe()

Wall time: 1.56 s

count    3.240604e+07
mean     1.198004e+01
std      4.956464e+02
min      1.000000e+00
25%      4.200000e+00
50%      7.400000e+00
75%      1.130000e+01
max      9.999900e+04
Name: prices, dtype: float64

In [51]:
%%time
ords_prods_customers_merge.loc[ords_prods_customers_merge['prices'] > 100, 'prices'] = np.nan

In [54]:
# Removing column to reduce some size

ords_prods_customers_merge.drop(columns = {'_merge'}, inplace = True)

In [56]:
ords_prods_customers_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406036 entries, 0 to 32406035
Data columns (total 29 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                int32
 1   user_id                 object
 2   order_number            int8
 3   order_day_of_week       int8
 4   order_time              int8
 5   days_since_prior_order  float16
 6   first_time_customer     bool
 7   product_id              int32
 8   add_to_cart_order       int32
 9   reordered               int32
 10  product_name            object
 11  aisle_id                int32
 12  department_id           int32
 13  prices                  float64
 14  max_order               int32
 15  loyalty_flag            object
 16  mean_price              float16
 17  spending_flag           object
 18  frequency               float16
 19  Customer Type           object
 20  first_name              object
 21  last_name               object
 22  gender                  object
 23  state                   object
 24  age                     int32
 25  date_joined             object
 26  n_dependants            int32
 27  fam_status              object
 28  income                  int32
dtypes: bool(1), float16(3), float64(1), int32(10), int8(3), object(11)
memory usage: 4.6+ GB

### Exporting Dataset

In [52]:
ords_prods_customers_merge_path = r'C:\Users\iNDIA\Desktop\Career Foundry\4 Python Fundamentals for Data Analysts\Instacart Basket Analysis Mar 22\02 Data\Prepared Data'

In [58]:
ords_prods_customers_merge.to_pickle(os.path.join(ords_prods_customers_merge_path, 'ords_prods_customers_merge.pkl'))